[
    {
        "company": "Canva",  
        "role": "Frontend Engineer Intern",
        "when": [
            {
                "start": "December 2019",
                "end": "February 2020"
            }
        ],
        "location": "Sydney, AU",
        "description": "",
        "achievements": []
    },
    {
        "company": "Atlassian",  
        "role": "Junior Software Engineer Intern",
        "when": [
            {
                "start": "October 2018",
                "end": "December 2018"
            }
        ],
        "location": "Sydney, AU",
        "description": "As part of Atlassian's Ecosystems team, I worked to improve the experience of developers across the world through developer.atlassian.com. My role primarily involved the development of React based applications in a modern agile environment.",
        "achievements": [
            "Finalist in internal hackathon “ShipIt”, built enhanced    post sprint report into the next generation of Jira.",
            "Made substantial contributions within the team to complete and ship a React & GraphQL based admin page for 3LO grants."
        ]
    },
    {
        "company": "Saphi Engineering",
        "role": "Front End Developer",
        "when": [
            {
                "start": "August 2017",
                "end": "February 2018"
            },
            {
                "start": "July 2018",
                "end": "October 2018 (Part Time)"
            }
        ],
        "location": "Newcastle, AU",
        "description": "At Saphi, I have been part of a fast paced team developing an Angular6 based web application utilising Google Firebase and aggregating data from a number of third party integrations.",
        "achievements": [
            "Gained experience building single page applications with Angular 2+, asynchronous programming with ReactiveX, and utilising Google Cloud Services.",
            "Developed services which pull data from a number of third parties including Github, Stack Overflow and GitLab."
        ]
    },
    {
        "company": "Cogesic",
        "role": "Full Stack Developer",
        "when": [
            {
                "start": "July 2017",
                "end": "February 2018"
            }
        ],
        "location": "Newcastle, AU",
        "description": "Cogesic is a startup based at the Dantia Smart Hub creating a NodeJS based generative development platform allowing declarative specifications to be used to generate artefacts such as code, business rules, documents, and partial or full applications.",
        "achievements": [
            "Utilised NodeJS to build a large number of server side applications, as well as created a number of React based components for front end use.",
            "Created 15+ new schema based documents for the platform utilising HTML/Sass as well as created a proprietary YAML based markup language for PDF generation in JavaScript.",
            "Gained experience maintaining and working within large codebases and collaborating heavily with other developers."
        ]
    },    
    {
        "company": "Unreal VR",
        "role": "Web Developer & Technical Support",
        "when": [
            {
                "start": "May 2017",
                "end": "November 2017"
            }
        ],
        "location": "Newcastle, AU",
        "description": "Unreal VR is a Virtual Reality company based in Newcastle, serving as a VR Arcade and providing VR services (game development and equipment) to the corporate market.",
        "achievements": [
            "Redesigned Unreal VR’s public facing games listings website, which currently receives an average of 500 visitors per week."
        ]
    }
]